Revit 2026 API
RebarBendData Constructor
Overload List
Name | Description
RebarBendData() |  Constructs a new RebarBendData with default settings.
RebarBendData(RebarBarType, RebarStyle, BarTerminationsData) |  Constructs a new RebarBendData using the bar type, style and termination's values.
RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) | Obsolete.
 Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
Top
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace